controllers/BrandController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => Brands::find(),
        ]);
---
SELECT * FROM `brands` LIMIT 20
SELECT COUNT(*) FROM `brands`

    public function actionIndexModels($id){
        $models = Models::find()->where(['brand_id' => $id])->all();
---
SELECT * FROM `models` WHERE `brand_id`='1'