controllers/ModelController.php

    public function actionIndexCanCommands($id){
        return CanCommands::findAll(['model_id' => $id]);
---
SELECT * FROM `canCommands` WHERE `model_id`='1'