controllers/ScenarioController.php

    public function actionCreate()
    {
        $model = new Scenario();
        $model->name = Yii::$app->request->post('name');
        $modelName = Yii::$app->request->post('model_name');
        $modelModel = Model::findOne(['name' => $modelName]);
---
SELECT * FROM `models` WHERE `id`='1'