controllers/ScenarioController.php

SELECT * FROM `scenario` WHERE `id`='2'
---
    public function actionDelete($id)
    {
        $userId = Yii::$app->user->id;
        $scenario = Scenario::findOne(['id' => $id, 'user_id' => $userId]);

SELECT * FROM `models` WHERE `id`=1
SELECT EXISTS(SELECT * FROM `models` WHERE `models`.`id`=1)
---
    public function actionUpdate($id)
    {
        $scenario = Scenario::findOne($id);
        if (!$scenario) {
            throw new NotFoundHttpException('Scenario not found.');
        }

        $postData = Yii::$app->request->getBodyParams();

        if (isset($postData['jsonData'])) {
            $scenario->jsonData = $postData['jsonData'];
            $scenario->data = Yii::$app->arduinoConverter->processJsonData($postData['jsonData']);
        }
        if (isset($postData['model_id'])) {
            $brandModel = Model::findOne($postData['model_id']);