controllers/UserController.php

SELECT * FROM `user` WHERE (`id` != '1') AND (`id` != 1)
---
    public function actionIndex()
    {
        $users = User::find()->all();